; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v7)
		(pred_3 ?v5)
		(pred_5 ?v4)
		(pred_6 ?v4)
		(pred_2 ?v5 ?v4)
		(pred_1)
		(pred_4 ?v5))

   (:action op_2
       :parameters  (?v1 ?v3)
       :precondition (and (not-eq ?v1 ?v3) 
                          (pred_5 ?v1) (pred_5 ?v3) (pred_6 ?v1))
       :effect (and  (pred_6 ?v3)
		     (not (pred_6 ?v1))))


   (:action op_3
       :parameters (?v8 ?v6)
       :precondition  (and  (pred_3 ?v8) (pred_5 ?v6)
			    (pred_2 ?v8 ?v6) (pred_6 ?v6) (pred_1))
       :effect (and (pred_4 ?v8)
		    (not (pred_2 ?v8 ?v6)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v8  ?v6)
       :precondition  (and  (pred_3 ?v8) (pred_5 ?v6)
			    (pred_4 ?v8) (pred_6 ?v6))
       :effect (and (pred_2 ?v8 ?v6)
		    (pred_1)
		    (not (pred_4 ?v8)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_02 
          obj_05 obj_04 obj_03 
)
(:init
(pred_5 obj_06)
(pred_5 obj_01)
(pred_5 obj_02)
(pred_3 obj_05)
(pred_3 obj_04)
(pred_3 obj_03)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(pred_1)
(pred_2 obj_05 obj_02)
(pred_2 obj_04 obj_06)
(pred_2 obj_03 obj_02)
(pred_6 obj_02)
)
(:goal
(and
(pred_2 obj_05 obj_06)
(pred_2 obj_04 obj_06)
(pred_2 obj_03 obj_02)
)
)

(:constraints
  (sometime-before  (pred_2 obj_05 obj_06) (pred_6 obj_01))
)
)

; plan
1. (op_3 obj_05 obj_02)
   deleted: (pred_2 obj_05 obj_02) (pred_1)
   added: (pred_4 obj_05)
   goals met: 2 of 3
2. (op_2 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 2 of 3
3. (op_1 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_2 obj_05 obj_01) (pred_1)
   goals met: 2 of 3
4. (op_2 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_06)
   goals met: 2 of 3
5. (op_3 obj_04 obj_06)
   deleted: (pred_2 obj_04 obj_06) (pred_1)
   added: (pred_4 obj_04)
   goals met: 1 of 3
6. (op_2 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_01)
   goals met: 1 of 3
7. (op_1 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_01) (pred_1)
   goals met: 1 of 3
8. (op_3 obj_05 obj_01)
   deleted: (pred_2 obj_05 obj_01) (pred_1)
   added: (pred_4 obj_05)
   goals met: 1 of 3
9. (op_2 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_06)
   goals met: 1 of 3
10. (op_1 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_2 obj_05 obj_06) (pred_1)
   goals met: 2 of 3
11. (op_2 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_01)
   goals met: 2 of 3
12. (op_3 obj_04 obj_01)
   deleted: (pred_2 obj_04 obj_01) (pred_1)
   added: (pred_4 obj_04)
   goals met: 2 of 3
13. (op_2 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_06)
   goals met: 2 of 3
14. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_06) (pred_1)
   goals met: 3 of 3
